

arr = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']
arr_2 = [y for x in arr for y in x.split(' ')]
#['инженер-конструктор', 'Игорь', 'главный', 'бухгалтер', 'МАРИНА', 'токарь', 'высшего', 'разряда', 'нИКОЛАй', 'директор', 'аэлита']
name_1 = arr_2.pop(1)
name_2 = arr_2.pop(3)
name_3 = arr_2.pop(6)
name_4 = arr_2.pop(7)

print('Привет, ' + name_1.capitalize())
print('Привет, ' + name_2.capitalize())
print('Привет, ' + name_3.capitalize())
print('Привет, ' + name_4.capitalize())


